# STLExportOptions Constructor (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
STLExportOptions Constructor
STLExportOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| STLExportOptions()()()() | Constructs a new instance of STLExportOptions with default values of all properties. |
| STLExportOptions(STLExportResolution) | Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |

# See Also
STLExportOptions Class
STLExportOptions Members
Autodesk.Revit.DB Namespace